{
  "metadata": {
    "grade": 10,
    "unit": 1,
    "lesson": "reading",
    "book": "global-success",
    "context": "Most people think that housework is boring and is the responsibility of wives and mothers only. Many parents don't ask their children to do housework so that they have more time to play or study. However, studies show doing chores is good for children.\n\n  Kids who do housework develop important life skills that they will need for the rest of their lives. Doing the laundry, cleaning the house, and taking care of others are among the important skills that children will need when they start their own families. These are the things that schools cannot fully teach, so it's important for children to learn them at home. Sharing housework also helps young people learn to take responsibility. They know that they have to try to finish their tasks even though they do not enjoy doing them. Doing chores also helps develop children's gratitude to their parents. When doing housework, they learn to appreciate all the hard work their parents do around the house for them. In addition, doing chores together helps strengthen family bonds, creating special moments between children and parents. It makes children feel they are members of a team.\n\n  All in all, doing housework can bring a lot of benefits to children. It teaches them life skills and helps build their character. Therefore, parents should encourage their kids to share the housework for their own good as well as the good of the whole family.",
    "createdAt": "2025-07-12T08:12:33.588Z",
    "totalWords": 3
  },
  "vocabulary": [
    {
      "word": "do the laundry",
      "type": "v",
      "meaning": "giặt đồ",
      "pronunciation": "duː ðə ˈlɔːndri",
      "irregular": false
    },
    {
      "word": "appreciate",
      "type": "v",
      "meaning": "đánh giá cao",
      "pronunciation": "əˈpriːʃieɪt",
      "irregular": false
    },
    {
      "word": "encourage",
      "type": "v",
      "meaning": "khuyến khích",
      "pronunciation": "ɪnˈkʌrɪdʒ",
      "irregular": false
    }
  ]
}